levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_gpio.c
/*  Parameter validity check for pin number. */
#define IS_GPIO_PIN(pin)    (((pin) & GPIO_PIN_MASK ) != (uint8_t)0x00U)

/*  Parameter validity check for get pin index. */
#define IS_GET_GPIO_PIN(pin)                                                    \
(   ((pin) == GPIO_PIN_0)                       ||                              \
    ((pin) == GPIO_PIN_1)                       ||                              \
    ((pin) == GPIO_PIN_2)                       ||                              \
    ((pin) == GPIO_PIN_3)                       ||                              \
    ((pin) == GPIO_PIN_4)                       ||                              \
    ((pin) == GPIO_PIN_5)                       ||                              \
    ((pin) == GPIO_PIN_6)                       ||                              \
    ((pin) == GPIO_PIN_7))

/*  Parameter validity check for port source. */
#define IS_GPIO_PORT(port)  (((port) & GPIO_PORT_MASK) != (uint16_t)0x0000U)

/*  Parameter validity check for port source. */
#define IS_GPIO_PORT_SOURCE(port)                                               \
(   ((port) == GPIO_PORT_0)                     ||                              \
    ((port) == GPIO_PORT_1)                     ||                              \
    ((port) == GPIO_PORT_2)                     ||                              \
    ((port) == GPIO_PORT_3)                     ||                              \
    ((port) == GPIO_PORT_4)                     ||                              \
    ((port) == GPIO_PORT_5)                     ||                              \
    ((port) == GPIO_PORT_7)                     ||                              \
    ((port) == GPIO_PORT_9)                     ||                              \
    ((port) == GPIO_PORT_A)                     ||                              \
    ((port) == GPIO_PORT_B)                     ||                              \
    ((port) == GPIO_PORT_D)                     ||                              \
    ((port) == GPIO_PORT_E))

#define IS_GPIO_FUNC(func)                                                      \
(   ((func) == GPIO_FUNC_0)                     ||                              \
    ((func) == GPIO_FUNC_1)                     ||                              \
    ((func) == GPIO_FUNC_2)                     ||                              \
    ((func) == GPIO_FUNC_3)                     ||                              \
    ((func) == GPIO_FUNC_4)                     ||                              \
    ((func) == GPIO_FUNC_5)                     ||                              \
    ((func) == GPIO_FUNC_6)                     ||                              \
    ((func) == GPIO_FUNC_7))

/*  Parameter validity check for debug pin definition. */
#define IS_GPIO_DEBUG_PORT(port)    (((port) & GPIO_PIN_DEBUG_JTAG) != (uint8_t)0x00)

/*  Parameter validity check for pin read wait cycle. */
#define IS_GPIO_READ_WAIT(wait)                                                 \
(   ((wait) == GPIO_READ_WAIT_0)                ||                              \
    ((wait) == GPIO_READ_WAIT_1)                ||                              \
    ((wait) == GPIO_READ_WAIT_2)                ||                              \
    ((wait) == GPIO_READ_WAIT_3))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup GPIO_Global_Functions GPIO Global Functions
 * @{
 */

/**
 * @brief  Initialize GPIO.
 * @param  [in] u8Port: GPIO_PORT_x, x can be (0~5, A,B,D,E) to select the GPIO peripheral
 * @param  [in] u8Pin: GPIO_PIN_x, x can be (0~7) to select the PIN index
 * @param  [in] pstcGpioInit: Pointer to a stc_gpio_init_t structure that
 *                            contains configuration information.
 * @retval Ok: GPIO initilize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t GPIO_Init(uint8_t u8Port, uint8_t u8Pin, const stc_gpio_init_t *pstcGpioInit)
{
    __IO uint16_t *PCRx;
    uint8_t u8PinPos = 0U;
    uint16_t u16PCRVal;
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcGpioInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Parameter validity checking */
        DDL_ASSERT(IS_GPIO_PORT_SOURCE(u8Port));
        DDL_ASSERT(IS_GPIO_PIN(u8Pin));
        DDL_ASSERT(IS_GPIO_PIN_STATE(pstcGpioInit->u16PinState));
        DDL_ASSERT(IS_GPIO_DIR(pstcGpioInit->u16PinDir));
        DDL_ASSERT(IS_GPIO_OTYPE(pstcGpioInit->u16PinOType));
        DDL_ASSERT(IS_GPIO_PIN_DRV(pstcGpioInit->u16PinDrv));
        DDL_ASSERT(IS_GPIO_LATCH(pstcGpioInit->u16Latch));
        DDL_ASSERT(IS_GPIO_PIN_PU(pstcGpioInit->u16PullUp));
        DDL_ASSERT(IS_GPIO_PIN_INVERT(pstcGpioInit->u16Invert));
        DDL_ASSERT(IS_GPIO_ITYPE(pstcGpioInit->u16PinIType));
        DDL_ASSERT(IS_GPIO_EXINT(pstcGpioInit->u16ExInt));

        GPIO_Unlock();

        for (u8PinPos = 0U; u8PinPos < 8U; u8PinPos++)
        {
            if (u8Pin & (1UL<<u8PinPos))
            {
                PCRx = (uint16_t *)((uint32_t)(&M4_GPIO->PCR00) +                  \
                                  u8Port * 0x20UL + u8PinPos * 4UL);

                u16PCRVal = pstcGpioInit->u16ExInt  | pstcGpioInit->u16PinIType |   \
                            pstcGpioInit->u16Invert | pstcGpioInit->u16PullUp   |   \
                            pstcGpioInit->u16Latch  | pstcGpioInit->u16PinDrv   |   \
                            pstcGpioInit->u16PinOType | pstcGpioInit->u16PinState | \
                            pstcGpioInit->u16PinDir;
                WRITE_REG16(*PCRx, u16PCRVal);
            }
        }

