levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_gpio.c
        GPIO_Lock();
    }
    return enRet;
}

/**
 * @brief  De-init GPIO register to default value
 * @param  None
 * @retval None
 */
void GPIO_DeInit(void)
{
    stc_gpio_init_t stcGpioInit;
    GPIO_StructInit(&stcGpioInit);

    /* PORT register unprotect */
    WRITE_REG16(M4_GPIO->PWPR, GPIO_REG_UNPROTECT);

    /* PORT0 reset */
    GPIO_Init(GPIO_PORT_0, (GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2), &stcGpioInit);
    /* PORT1 reset */
    GPIO_Init(GPIO_PORT_1, (GPIO_PIN_0 | GPIO_PIN_1), &stcGpioInit);
    /* PORT2 reset */
    GPIO_Init(GPIO_PORT_2, (GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4), &stcGpioInit);
    /* PORT3 reset */
    GPIO_Init(GPIO_PORT_3,                                                      \
             (GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_6 |  \
              GPIO_PIN_7), &stcGpioInit);
    /* PORT4 reset */
    GPIO_Init(GPIO_PORT_4, GPIO_PIN_ALL, &stcGpioInit);
    /* PORT5 reset */
    GPIO_Init(GPIO_PORT_5, GPIO_PIN_0, &stcGpioInit);
    /* PORT7 reset */
    GPIO_Init(GPIO_PORT_7,                                                      \
              (GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4 | \
               GPIO_PIN_5 | GPIO_PIN_6), &stcGpioInit);
    /* PORT9 reset */
    GPIO_Init(GPIO_PORT_9, (GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4), \
              &stcGpioInit);
    /* PORTA reset */
    GPIO_Init(GPIO_PORT_A, (GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5), \
              &stcGpioInit);
    /* PORTB reset */
    GPIO_Init(GPIO_PORT_B, GPIO_PIN_ALL, &stcGpioInit);
    /* PORTD reset */
    GPIO_Init(GPIO_PORT_D,                                                     \
              (GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7),\
              &stcGpioInit);
    /* PORTE reset */
    GPIO_Init(GPIO_PORT_E, GPIO_PIN_0, &stcGpioInit);

    /* PORT global register reset */
    WRITE_REG16(M4_GPIO->PSPCR, GPIO_PSPCR_RESET_VALUE);
    WRITE_REG16(M4_GPIO->PCCR, GPIO_PCCR_RESET_VALUE);
    WRITE_REG16(M4_GPIO->PINAER, GPIO_PINAER_RESET_VALUE);

    /* PORT registers protected */
    WRITE_REG16(M4_GPIO->PWPR, GPIO_REG_PROTECT);
}

/**
 * @brief  Initialize GPIO. Fill each pstcGpioInit with default value
 * @param  [in] pstcGpioInit: Pointer to a stc_gpio_init_t structure that
 *                            contains configuration information.
 * @retval Ok: GPIO structure initilize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t GPIO_StructInit(stc_gpio_init_t *pstcGpioInit)
{
    en_result_t enRet = Ok;
    /* Check if pointer is NULL */
    if (NULL == pstcGpioInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Reset GPIO init structure parameters values */
        pstcGpioInit->u16PinState   = PIN_STATE_RESET;
        pstcGpioInit->u16PinDir     = PIN_DIR_IN;
        pstcGpioInit->u16PinOType   = PIN_OTYPE_CMOS;
        pstcGpioInit->u16PinDrv     = PIN_NORMAL_DRV;
        pstcGpioInit->u16Latch      = PIN_LATCH_OFF;
        pstcGpioInit->u16PullUp     = PIN_PU_OFF;
        pstcGpioInit->u16Invert     = PIN_INVERT_OFF;
        pstcGpioInit->u16PinIType   = PIN_ITYPE_SMT;
        pstcGpioInit->u16ExInt      = PIN_EXINT_OFF;
    }
    return enRet;
}

/**
 * @brief  GPIO debug port configure. Set debug pins to GPIO
 * @param  [in] u8DebugPort
 *   @arg  GPIO_PIN_SWDIO
 *   @arg  GPIO_PIN_SWCLK
 *   @arg  GPIO_PIN_SWO
 *   @arg  GPIO_PIN_DEBUG_SWD
 *   @arg  GPIO_PIN_TCK
 *   @arg  GPIO_PIN_TMS
 *   @arg  GPIO_PIN_TDO
 *   @arg  GPIO_PIN_TDI
 *   @arg  GPIO_PIN_TRST
 *   @arg  GPIO_PIN_DEBUG_JTAG
 * @param  [in] enNewState
 *   @arg  Enable, set to debug port (SWD/JTAG)
 *   @arg  Disable, set to GPIO
 * @retval None
 */
void GPIO_SetDebugPort(uint8_t u8DebugPort, en_functional_state_t enNewState)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_GPIO_DEBUG_PORT(u8DebugPort));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    GPIO_Unlock();

    if (Enable == enNewState)
    {
        //M4_GPIO->PSPCR |= (uint16_t)((uint16_t)u8DebugPort & 0x1FU);
        SET_REG16_BIT(M4_GPIO->PSPCR, (u8DebugPort & GPIO_PSPCR_SPFE));
    }
    else
    {
        //M4_GPIO->PSPCR &= (uint16_t)(~((uint16_t)u8DebugPort & 0x1FU));
        CLEAR_REG16_BIT(M4_GPIO->PSPCR, (u8DebugPort & GPIO_PSPCR_SPFE));
    }

    GPIO_Lock();
}


/**
 * @brief  Set specified Port Pin function
 * @param  [in] u8Port: GPIO_PORT_x, x can be (0~5, A,B,D,E) to select the GPIO peripheral
 * @param  [in] u8Pin: GPIO_PIN_x, x can be (0~7) to select the PIN index
 * @param  [in] u8Func: GPIO_FUNC_x, x can be selected from GPIO function definitions
 * @retval None
 */
void GPIO_SetFunc(uint8_t u8Port, uint8_t u8Pin, uint8_t u8Func)
{
    __IO uint16_t *PFSRx;
    uint8_t u8PinPos = 0U;

    /* Parameter validity checking */
    DDL_ASSERT(IS_GPIO_PORT_SOURCE(u8Port));
    DDL_ASSERT(IS_GPIO_PIN(u8Pin));
    DDL_ASSERT(IS_GPIO_FUNC(u8Func));

    GPIO_Unlock();

    for (u8PinPos = 0U; u8PinPos < 8U; u8PinPos ++)
    {
        if (u8Pin & (1UL<<u8PinPos))
        {
            PFSRx = (uint16_t *)((uint32_t)(&M4_GPIO->PFSR00) + \
                                              u8Port * 0x20UL + u8PinPos * 4UL);
            WRITE_REG16(*PFSRx, u8Func);
        }
    }

    GPIO_Lock();
}

/**
 * @brief  Initialize GPIO.
 * @param  [in] u8Port: GPIO_PORT_x, x can be (0~5, A,B,D,E) to select the GPIO peripheral
 * @param  [in] u8Pin: GPIO_PIN_x, x can be (0~7) to select the PIN index
 * @param  [in] enNewState
 *   @arg  Enable, set specified pin output enable
 *   @arg  Disable, set specified pin output disable
 * @retval None
 */
void GPIO_OE(uint8_t u8Port, uint8_t u8Pin, en_functional_state_t enNewState)
{
    __IO uint8_t *POERx;

    /* Parameter validity checking */
    DDL_ASSERT(IS_GPIO_PORT_SOURCE(u8Port));
    DDL_ASSERT(IS_GPIO_PIN(u8Pin));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    POERx = (uint8_t *)((uint32_t)(&M4_GPIO->POER0) + u8Port);
    if (Enable == enNewState)
    {
        //*POERx |= u8Pin;
        SET_REG8_BIT(*POERx, u8Pin);
    }
    else
    {
        //*POERx &= ((~u8Pin) & 0xFFu);
        CLEAR_REG8_BIT(*POERx, u8Pin);
    }
}

/**
 * @brief  GPIO read wait cycle configure.
 * @param  [in] u16ReadWait
 *   @arg  GPIO_READ_WAIT_0
 *   @arg  GPIO_READ_WAIT_1
 *   @arg  GPIO_READ_WAIT_2
 *   @arg  GPIO_READ_WAIT_3
 * @retval None
 */
void GPIO_PortReadWait(uint16_t u16ReadWait)
{
    DDL_ASSERT(IS_GPIO_READ_WAIT(u16ReadWait));

